In [91]:
import pandas as pd

In [92]:
df = pd.read_csv('train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [93]:
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import GaussianNB
from sklearn.metrics import confusion_matrix,accuracy_score

In [94]:
le = LabelEncoder()
df['Sex'] = le.fit_transform(df['Sex'])
df['Embarked'] = le.fit_transform(df['Embarked'])

In [95]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,0

In [96]:
df['Embarked'].value_counts()

2    644
0    168
1     77
Name: Embarked, dtype: int64

Using loop

In [117]:
df1 = df.drop(['PassengerId','Name','Ticket','Cabin'],axis=1)

In [118]:
df1.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         2
1         1       1    0  38.0      1      0  71.2833         0
2         1       3    0  26.0      0      0   7.9250         2
3         1       1    0  35.0      1      0  53.1000         2
4         0       3    1  35.0      0      0   8.0500         2

In [119]:
df1.columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Embarked'],
      dtype='object')

In [136]:
for i in ('Survived', 'Pclass', 'Sex', 'SibSp', 'Parch','Embarked'):
    print ("Dependent Variable =",i)
    y= df1[i]
    X= df1.drop([i],axis=1)
    X_train, X_test, y_train, y_test = train_test_split( X, y, test_size=0.3, random_state=42)
    y_pred = nb.fit(X_train,y_train).predict(X_test)
    print("Accuracy Score =",accuracy_score(y_test,y_pred, normalize=True))
    print("Confusion Matrix \n",confusion_matrix(y_test,y_pred))
    print("\n")

Dependent Variable = Survived
Accuracy Score = 0.7827715355805244
Confusion Matrix
 [[135  32]
 [ 26  74]]


Dependent Variable = Pclass
Accuracy Score = 0.7340823970037453
Confusion Matrix
 [[ 48  11   7]
 [  1  23  34]
 [  2  16 125]]


Dependent Variable = Sex
Accuracy Score = 0.7378277153558053
Confusion Matrix
 [[ 55  45]
 [ 25 142]]


Dependent Variable = SibSp
Accuracy Score = 0.6554307116104869
Confusion Matrix
 [[153  11   3  23   0   0   0]
 [ 26  13   0  17   0   0   0]
 [  5   1   0   1   0   0   0]
 [  1   0   0   1   2   0   0]
 [  0   0   0   1   5   0   0]
 [  0   0   0   1   0   1   0]
 [  0   0   0   0   0   0   2]]


Dependent Variable = Parch
Accuracy Score = 0.3857677902621723
Confusion Matrix
 [[ 87  11   3   0 106   0]
 [ 16   7   5   0   9   0]
 [  8   1   9   0   2   0]
 [  0   0   0   0   0   0]
 [  0   0   0   0   0   1]
 [  1   0   0   1   0   0]]


Dependent Variable = Embarked
Accuracy Score = 0.50187265917603
Confusion Matrix
 [[19 17 15]
 [ 1 18  4]
 [14 82 97]]